In [1]:
import pandas as pd

### apply 함수에 파라미터 전달하기
키워드 파라미터를 사용하시면, apply가 적용된 함수에 파라미터를 전달하실 수 있습니다.

In [2]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

apply함수를 이용하여 컬럼 추가

In [3]:
def extract_year(row):  
    return row.split('-')[0] # 첫번째 인자만 가지고 년도 컬럼을 만든다

In [4]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [5]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

올해 년도에서 년도를 빼서 나이를 만드는 함수

In [8]:
def extract_year(year, current_year):  
    return current_year - int(year)

In [9]:
df['age'] = df['year'].apply(extract_year, current_year=2024)

In [10]:
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   24
1  2002-09-24  2002   22
2  2005-12-20  2005   19

### apply 함수에 한 개 이상의 파라미터 전달하기
키워드 파라미터를 추가해주시면, 원하시는만큼의 파라미터를 함수에 전달 가능합니다.

In [11]:
def get_introduce(age, prefix, suffix):  # 여러개의 파라미터
    return prefix + str(age) + suffix

In [12]:
df['introduce'] = df['age'].apply(get_introduce, prefix="I am ", suffix=" years old")

In [13]:
df

   yyyy-mm-dd  year  age          introduce
0  2000-06-27  2000   24  I am 24 years old
1  2002-09-24  2002   22  I am 22 years old
2  2005-12-20  2005   19  I am 19 years old

### apply 함수에 여러개의 컬럼을 동시에 전달하기
axis=1이라는 키워드 파라미터를 apply 함수에 전달해주면, 모든 컬럼을 지정된 함수에서 사용 가능합니다.

In [14]:
def get_introduce2(row):
    return "I was born in "+str(row.year)+" my age is "+str(row.age)

In [15]:
df.introduce = df.apply(get_introduce2, axis=1)
# df['introduce_2'] = df.apply(get_introduce2, axis=1)  # 이렇게 사용해도 됨

In [16]:
df

   yyyy-mm-dd  year  age                        introduce
0  2000-06-27  2000   24  I was born in 2000 my age is 24
1  2002-09-24  2002   22  I was born in 2002 my age is 22
2  2005-12-20  2005   19  I was born in 2005 my age is 19